package homeWorks.homeWork11.firstLevel;

public class Quest5_1 {
    public static void main(String[] args) {
        String[] surnames ={"Петров","Иванов","Сидоров","Гудков","Смирнов"};
        for (int i = 0; i <surnames.length; i++) {
            System.out.println(surnames[i]);
        }
    }
}
//Создайте массив из пяти фамилий и выведите их на экран столбиком.
