package homeWorks.homeWork8.secondtLevel;

import java.util.Scanner;

public class Qest1_2 {
    public static void main(String[] args) {
//        Scanner scan = new Scanner(System.in);
//        System.out.print( "Введите первый множитель: ");//2*3=2+2+2=3+3
//        int раз = scan.nextInt();
//        System.out.print( "Введите второй множитель: ");
//        int число = scan.nextInt();
//        int суммаЧисел =0;
//        for (int i = раз; i < 3; i=i++) {
//            суммаЧисел=суммаЧисел+число;
//            System.out.println(суммаЧисел);

//        }
//        int first = 2;
//        int sec = 3;
//        int sum = 0;
//
//
//        for (int i = first; i = sum; i=i+first) {
////            for (int j = 0; j < 100; j++) {
//                if (sec == sum / first ) {
////                    continue;
//
//                }
//            sum=sum+i;
//            System.out.println(sum);
//            }
//        }


//            int sum = 0;
//            for (int i = 20; i < 40; i++) {
//                if (i % 2 == 0) {
//                    sum = sum + i;
//                }
//            }
//            System.out.println(sum);

    }}

// написать программу которая выводит результат умножения одного числа на другое,
// не используя *. только знаки сложения
//Подсказка: 5 * 3 = 5+5+5. (используйте цикл)